PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* \file cy_sd_host.c
* \version 2.40
*
* \brief
*  This file provides the driver code to the API for the SD Host Controller
*  driver.
*
********************************************************************************
* \copyright
* Copyright 2018-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXSDHC)

#include "cy_sd_host.h"
#include <string.h>
#include <stdlib.h>

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 18.1', 11, \
                             'Checked manually, base pointer will not exceed register range.')

/** \cond internal */

/* Timeouts. */
#define CY_SD_HOST_INT_CLK_STABLE_TIMEOUT_MS (150U)  /* The Internal Clock Stable timeout. */
#define CY_SD_HOST_1_8_REG_STABLE_TIME_MS   (30UL)   /* The 1.8 voltage regulator stable time. */
#define CY_SD_HOST_SUPPLY_RAMP_UP_TIME_MS   (35UL)   /* The host supply ramp up time. */
#define CY_SD_HOST_BUS_RAMP_UP_TIME_MS      (1000UL) /* The host bus voltage ramp up time. */

#define CY_SD_HOST_EMMC_CMD6_TIMEOUT_MULT   (10UL)   /* The 10x multiplier of GENERIC_CMD6_TIME[248]. */
#define CY_SD_HOST_RETRY_TIME               (1000UL) /* The number loops to make the timeout in msec. */
#define CY_SD_HOST_VOLTAGE_CHECK_RETRY      (2UL)    /* The number loops for voltage check. */
#define CY_SD_HOST_SDIO_CMD5_TIMEOUT_MS     (1000U)  /* The SDIO CMD5 timeout. */
#define CY_SD_HOST_ACMD41_TIMEOUT_MS        (1000U)  /* The ACMD41 timeout. */
#define CY_SD_HOST_CMD1_TIMEOUT_MS          (1000U)  /* The eMMC device timeout to complete its initialization. */
#define CY_SD_HOST_CMD_TIMEOUT_MS           (3U)     /* The Command complete timeout. */
#define CY_SD_HOST_BUFFER_RDY_TIMEOUT_MS    (150U)   /* The Buffer read ready timeout. */
#define CY_SD_HOST_RD_WR_ENABLE_TIMEOUT     (1U)     /* The valid data in the Host buffer timeout. */
#define CY_SD_HOST_READ_TIMEOUT_MS          (100U)   /* The Read timeout for one block. */
#define CY_SD_HOST_WRITE_TIMEOUT_MS         (250U)   /* The Write timeout for one block. */
#define CY_SD_HOST_MAX_TIMEOUT              (0x0EU)  /* The data max timeout for TOUT_CTRL_R. */
#define CY_SD_HOST_NCC_MIN_CYCLES           (8U)     /* The period (clock cycles) between an end bit
                                                      * of the command and a start bit of the next command.
                                                      */
#define CY_SD_HOST_NCC_MIN_US               ((1000U * CY_SD_HOST_NCC_MIN_CYCLES) / CY_SD_HOST_INIT_CLK_FREQUENCY_KHZ)

/* Commands codes. */
#define CY_SD_HOST_SD_CMD0                  (0UL)
#define CY_SD_HOST_SD_CMD1                  (1UL)
#define CY_SD_HOST_SD_CMD2                  (2UL)
#define CY_SD_HOST_SD_CMD3                  (3UL)
#define CY_SD_HOST_SD_CMD5                  (5UL)
#define CY_SD_HOST_SD_CMD6                  (6UL)
#define CY_SD_HOST_SD_CMD7                  (7UL)
#define CY_SD_HOST_SD_CMD8                  (8UL)
#define CY_SD_HOST_SD_CMD9                  (9UL)
#define CY_SD_HOST_SD_CMD10                 (10UL)
#define CY_SD_HOST_SD_CMD11                 (11UL)
#define CY_SD_HOST_SD_CMD12                 (12UL)
#define CY_SD_HOST_SD_CMD13                 (13UL)

#define CY_SD_HOST_SD_CMD16                 (16UL)
#define CY_SD_HOST_SD_CMD17                 (17UL)
#define CY_SD_HOST_SD_CMD18                 (18UL)

#define CY_SD_HOST_SD_CMD23                 (23UL)
#define CY_SD_HOST_SD_CMD24                 (24UL)
#define CY_SD_HOST_SD_CMD25                 (25UL)

#define CY_SD_HOST_SD_CMD27                 (27UL)
#define CY_SD_HOST_SD_CMD28                 (28UL)
#define CY_SD_HOST_SD_CMD29                 (29UL)
#define CY_SD_HOST_SD_CMD30                 (30UL)

#define CY_SD_HOST_SD_CMD32                 (32UL)
#define CY_SD_HOST_SD_CMD33                 (33UL)
#define CY_SD_HOST_SD_CMD35                 (35UL)
#define CY_SD_HOST_SD_CMD36                 (36UL)
#define CY_SD_HOST_SD_CMD38                 (38UL)

#define CY_SD_HOST_SD_CMD42                 (42UL)
#define CY_SD_HOST_SD_CMD52                 (52UL)

#define CY_SD_HOST_SD_CMD55                 (55UL)

#define CY_SD_HOST_MMC_CMD_TAG              (0x80UL)
#define CY_SD_HOST_MMC_CMD8                 (0x8UL | CY_SD_HOST_MMC_CMD_TAG)

#define CY_SD_HOST_SD_ACMD_OFFSET           (0x40UL)
#define CY_SD_HOST_SD_ACMD6                 (CY_SD_HOST_SD_ACMD_OFFSET + 6UL)
#define CY_SD_HOST_SD_ACMD13                (CY_SD_HOST_SD_ACMD_OFFSET + 13UL)
#define CY_SD_HOST_SD_ACMD41                (CY_SD_HOST_SD_ACMD_OFFSET + 41UL)
#define CY_SD_HOST_SD_ACMD51                (CY_SD_HOST_SD_ACMD_OFFSET + 51UL)

/* CMD5/CMD8/ACMD41 constants. */
#define CY_SD_HOST_CMD5_IO_NUM_MASK         (0x70000000UL) /* The Number of IO functions mask. */
#define CY_SD_HOST_CMD5_MP_MASK             (0x08000000UL) /* The Memory Present mask. */
#define CY_SD_HOST_IO_OCR_MASK              (0x00FFFFFFUL) /* The IO OCR register mask. */
#define CY_SD_HOST_IO_OCR_C                 (0x80000000UL) /* The IO power up status (IORDY). */
#define CY_SD_HOST_MIN_SDXC_SECTORS         (67108864UL) /* Minimum sectors for SDXC: 32 Gbytes / 512. */
#define CY_SD_HOST_MMC_LEGACY_SIZE_BYTES    (0x200000UL)
#define CY_SD_HOST_CMD8_VHS_27_36           (0x100UL) /* CMD8 voltage supplied 2.7-3.6 V. */
#define CY_SD_HOST_CMD8_PATTERN_MASK        (0xFFUL)
#define CY_SD_HOST_CMD8_CHECK_PATTERN       (0xAAUL)
#define CY_SD_HOST_ACMD41_S18R              (1UL << 24U) /* The 1.8 V request. */
#define CY_SD_HOST_ACMD41_HCS               (1UL << 30U) /* SDHC or SDXC supported. */
#define CY_SD_HOST_OCR_S18A                 (1UL << 24U) /* The 1.8 V accepted. */
#define CY_SD_HOST_OCR_35_36_V              (1UL << 23U) /* The 3.5 - 3.6 voltage window. */
#define CY_SD_HOST_OCR_34_35_V              (1UL << 22U) /* The 3.4 - 3.5 voltage window. */
#define CY_SD_HOST_OCR_33_34_V              (1UL << 21U) /* The 3.3 - 3.4 voltage window. */
#define CY_SD_HOST_OCR_32_33_V              (1UL << 20U) /* The 3.2 - 3.3 voltage window. */
#define CY_SD_HOST_OCR_31_32_V              (1UL << 19U) /* The 3.1 - 3.2 voltage window. */
#define CY_SD_HOST_OCR_30_31_V              (1UL << 18U) /* The 3.0 - 3.1 voltage window. */
#define CY_SD_HOST_OCR_29_30_V              (1UL << 17U) /* The 2.9 - 3.0 voltage window. */
#define CY_SD_HOST_OCR_28_29_V              (1UL << 16U) /* The 2.8 - 2.9 voltage window. */
#define CY_SD_HOST_OCR_27_28_V              (1UL << 15U) /* The 2.7 - 2.8 voltage window. */
#define CY_SD_HOST_ACMD41_VOLTAGE_MASK      (CY_SD_HOST_OCR_35_36_V |\
                                             CY_SD_HOST_OCR_34_35_V |\
                                             CY_SD_HOST_OCR_33_34_V |\
                                             CY_SD_HOST_OCR_32_33_V |\
                                             CY_SD_HOST_OCR_31_32_V |\
                                             CY_SD_HOST_OCR_30_31_V |\
                                             CY_SD_HOST_OCR_29_30_V |\
                                             CY_SD_HOST_OCR_28_29_V |\
                                             CY_SD_HOST_OCR_27_28_V)
#define CY_SD_HOST_ARG_ACMD41_BUSY          (0x80000000UL)
#define CY_SD_HOST_OCR_BUSY_BIT             (0x80000000UL) /* The Card power up status bit (busy). */
#define CY_SD_HOST_OCR_CAPACITY_MASK        (0x40000000UL) /* The OCR sector access mode bit. */
#define CY_SD_HOST_ACMD_OFFSET_MASK         (0x3FUL)
#define CY_SD_HOST_EMMC_DUAL_VOLTAGE        (0x00000080UL)
#define CY_SD_HOST_EMMC_VOLTAGE_WINDOW      (CY_SD_HOST_OCR_CAPACITY_MASK |\
                                             CY_SD_HOST_EMMC_DUAL_VOLTAGE |\
                                             CY_SD_HOST_ACMD41_VOLTAGE_MASK)

/* Other constants. */
#define CY_SD_HOST_SWITCH_FUNCTION_BIT      (31U)
#define CY_SD_HOST_DEFAULT_SPEED            (0UL)
#define CY_SD_HOST_HIGH_SPEED               (1UL)
#define CY_SD_HOST_SDR12_SPEED              (0UL)  /* The SDR12/Legacy speed. */
#define CY_SD_HOST_SDR25_SPEED              (1UL)  /* The SDR25/High Speed SDR speed. */
#define CY_SD_HOST_SDR50_SPEED              (2UL)  /* The SDR50 speed. */
#define CY_SD_HOST_DDR50_SPEED              (4UL)  /* The DDR50 speed. */
#define CY_SD_HOST_SDR12_OUT_DELAY          (0UL)
#define CY_SD_HOST_SDR25_OUT_DELAY          (1UL)
#define CY_SD_HOST_DDR50_OUT_DELAY          (3UL)
#define CY_SD_HOST_SDR12_IN_DELAY           (0UL)
#define CY_SD_HOST_SDR25_IN_DELAY           (1UL)
#define CY_SD_HOST_HIGH_SPEED_IN_DELAY      (2UL)
#define CY_SD_HOST_DDR50_IN_DELAY           (3UL)
#define CY_SD_HOST_EMMC_BUS_WIDTH_ADDR      (0xB7UL)
#define CY_SD_HOST_EMMC_HS_TIMING_ADDR      (0xB9UL)
#define CY_SD_HOST_CMD23_BLOCKS_NUM_MASK    (0xFFFFUL)
#define CY_SD_HOST_CMD23_RELIABLE_WRITE_POS (31U)
#define CY_SD_HOST_RCA_SHIFT                (16U)
#define CY_SD_HOST_RESPONSE_SIZE            (4U)
#define CY_SD_HOST_CID_SIZE                 (4U)
#define CY_SD_HOST_CSD_SIZE                 (4U)
#define CY_SD_HOST_SCR_BLOCKS               (8UL)
#define CY_SD_HOST_CSD_BLOCKS               (16UL)
#define CY_SD_HOST_SD_STATUS_BLOCKS         (64UL)
#define CY_SD_HOST_SWITCH_STATUS_LEN        (16UL)
#define CY_SD_HOST_PERI_FREQUENCY           (100000000UL)
#define CY_SD_HOST_FREQ_SEL_MSK             (0xFFUL)
#define CY_SD_HOST_UPPER_FREQ_SEL_POS       (8U)

/* CMD6 SWITCH command bitfields. */
#define CY_SD_HOST_EMMC_CMD6_ACCESS_OFFSET  (24U)
#define CY_SD_HOST_EMMC_CMD6_IDX_OFFSET     (16U)
#define CY_SD_HOST_EMMC_CMD6_VALUE_OFFSET   (8U)
#define CY_SD_HOST_EMMC_CMD6_CMD_SET_OFFSET (0U)

