PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
    blkCnt = pcmd->numberOfBlock;
    blkSize = pcmd->blockSize;

    while (0UL < blkCnt)
    {
        /* Wait for the Buffer Write ready. */
        ret = Cy_SD_Host_PollBufferWriteReady(base);

        if (CY_SD_HOST_SUCCESS != ret)
        {
            break;
        }

        for (i = blkSize >> 2UL; i != 0UL; i--)
        {
            /* Wait if space is available for writing data. */
            retry = CY_SD_HOST_RETRY_TIME;
            while ((false == _FLD2BOOL(SDHC_CORE_PSTATE_REG_BUF_WR_ENABLE,
                                       SDHC_CORE_PSTATE_REG(base))) &&
                    (retry > 0UL))
            {
                Cy_SysLib_DelayUs(CY_SD_HOST_RD_WR_ENABLE_TIMEOUT);
                retry--;
            }

            if (false == _FLD2BOOL(SDHC_CORE_PSTATE_REG_BUF_WR_ENABLE,
                                   SDHC_CORE_PSTATE_REG(base)))
            {
                break;
            }

            /* Write data to the Host buffer. */
            (void)Cy_SD_Host_BufferWrite(base, *pcmd->data);
            pcmd->data++;
        }
        blkCnt--;
    }

    ret = Cy_SD_Host_PollTransferComplete(base);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Check if DAT line is active. */
        ret = Cy_SD_Host_PollDataLineFree(base);
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SendCommand
****************************************************************************//**
*
*  Starts sending a command on the SD bus. If the command uses the data lines
*  Cy_SD_Host_InitDataTransfer() must be call first.
*  This function returns before the command completes.
*  To determine if the command is done, read the Normal Interrupt Status register
*  and check the CMD_COMPLETE flag. To determine if the entire transfer is done
*  check the XFER_COMPLETE flag. Also the interrupt is used and flags are set
*  on these events in an ISR.
* \note It is the user's responsibility to clear the CY_SD_HOST_CMD_COMPLETE flag
*  after calling this function.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *config
*  The configuration structure for the command.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SendCommand(SDHC_Type *base,
        cy_stc_sd_host_cmd_config_t const *config)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;

    if ((NULL != base) && (NULL != config))
    {
        CY_ASSERT_L2(CY_SD_HOST_IS_CMD_IDX_VALID(config->commandIndex));
        CY_ASSERT_L3(CY_SD_HOST_IS_CMD_TYPE_VALID(config->cmdType));

        ret = Cy_SD_Host_PollCmdLineFree(base);
        if (CY_SD_HOST_SUCCESS == ret)
        {
            if ((true == config->dataPresent) && (CY_SD_HOST_CMD_ABORT != config->cmdType))
            {
                /* Check the DAT line inhibits only commands with the DAT line is used
                * and when the command is not the ABORT type.
                */
                ret = Cy_SD_Host_PollDataLineNotInhibit(base);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Set the commandArgument directly to the hardware register. */
                SDHC_CORE_ARGUMENT_R(base) = config->commandArgument;

                /* Update the command hardware register (the command is sent)
                * according to the spec, this register should be written only once.
                */
                SDHC_CORE_CMD_R(base) = (uint16_t)(_VAL2FLD(SDHC_CORE_CMD_R_CMD_TYPE, 0U) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_RESP_TYPE_SELECT, (uint32_t)config->respType) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_CMD_TYPE, (uint32_t)config->cmdType) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_DATA_PRESENT_SEL, ((true == config->dataPresent) ? 1U : 0U)) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_CMD_IDX_CHK_ENABLE, ((true == config->enableIdxCheck) ? 1U : 0U)) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_CMD_CRC_CHK_ENABLE, ((true == config->enableCrcCheck) ? 1U : 0U)) |
                                                   _VAL2FLD(SDHC_CORE_CMD_R_CMD_INDEX, config->commandIndex & CY_SD_HOST_ACMD_OFFSET_MASK));
            }
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetBusWidth
****************************************************************************//**
*
*  Sends out the SD bus width changing command.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param width
*     The width of the data bus.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SetBusWidth(SDHC_Type *base,
        cy_en_sd_host_bus_width_t width,
        cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t    ret = CY_SD_HOST_SUCCESS;
    uint32_t                  cmdArgument = 0UL;

    if ((NULL != base) && (NULL != context))
    {
        if (CY_SD_HOST_SD == context->cardType)
        {
            switch (width)
            {
            case CY_SD_HOST_BUS_WIDTH_1_BIT:
                cmdArgument = 0UL;  /* 0 = 1bit */
                break;
            case CY_SD_HOST_BUS_WIDTH_4_BIT:
                cmdArgument = 2UL;  /* 2 = 4bit */
                break;
            default:
                ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                break;
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                ret = Cy_SD_Host_OpsSetSdBusWidth(base, cmdArgument, context);
            }
        }
        else if (CY_SD_HOST_EMMC == context->cardType)
        {
            switch (width)
            {
            /* The CMD6 Argument data structure:
             * [ACCESS:2]<<24 | [EXT_CSD IDX:8]<<16
             * |[Value:8]<<8 | [CMD set:2]<<0
             */
            case CY_SD_HOST_BUS_WIDTH_1_BIT:
                cmdArgument = (CY_SD_HOST_EMMC_ACCESS_WRITE_BYTE << CY_SD_HOST_EMMC_CMD6_ACCESS_OFFSET) |
                              (CY_SD_HOST_EMMC_BUS_WIDTH_ADDR << CY_SD_HOST_EMMC_CMD6_IDX_OFFSET) |
                              (0x0UL << CY_SD_HOST_EMMC_CMD6_VALUE_OFFSET) |
                              (0x0UL << CY_SD_HOST_EMMC_CMD6_CMD_SET_OFFSET);
                break;
            case CY_SD_HOST_BUS_WIDTH_4_BIT:
                cmdArgument = (CY_SD_HOST_EMMC_ACCESS_WRITE_BYTE << CY_SD_HOST_EMMC_CMD6_ACCESS_OFFSET) |
                              (CY_SD_HOST_EMMC_BUS_WIDTH_ADDR << CY_SD_HOST_EMMC_CMD6_IDX_OFFSET) |
                              (0x1UL << CY_SD_HOST_EMMC_CMD6_VALUE_OFFSET) |
                              (0x0UL << CY_SD_HOST_EMMC_CMD6_CMD_SET_OFFSET);
                break;
            case CY_SD_HOST_BUS_WIDTH_8_BIT:
                cmdArgument = (CY_SD_HOST_EMMC_ACCESS_WRITE_BYTE << CY_SD_HOST_EMMC_CMD6_ACCESS_OFFSET) |
                              (CY_SD_HOST_EMMC_BUS_WIDTH_ADDR << CY_SD_HOST_EMMC_CMD6_IDX_OFFSET) |
                              (0x2UL << CY_SD_HOST_EMMC_CMD6_VALUE_OFFSET) |
                              (0x0UL << CY_SD_HOST_EMMC_CMD6_CMD_SET_OFFSET);
                break;
            default:
                ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                break;
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Send CMD6 */
                ret = Cy_SD_Host_OpsSwitchFunc(base, cmdArgument);
            }
        }
        else if (CY_SD_HOST_SDIO == context->cardType)
        {
            switch (width)
            {
            case CY_SD_HOST_BUS_WIDTH_1_BIT:
                cmdArgument = 0UL;
                break;
            case CY_SD_HOST_BUS_WIDTH_4_BIT:
                cmdArgument = CY_SD_HOST_CCCR_BUS_WIDTH_1;
                break;
            case CY_SD_HOST_BUS_WIDTH_8_BIT:
                cmdArgument = CY_SD_HOST_CCCR_BUS_WIDTH_0 |
                              CY_SD_HOST_CCCR_BUS_WIDTH_1 |
                              CY_SD_HOST_CCCR_S8B;
                break;
            default:
                ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                break;
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                ret = Cy_SD_Host_OpsSendIoRwDirectCmd(base,
                                                      1UL,
                                                      0UL,
                                                      0UL,
                                                      CY_SD_HOST_CCCR_BUS_INTERFACE_CTR,
                                                      cmdArgument);
            }
        }
        else
        {
            ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Update the host side setting. */
            ret = Cy_SD_Host_SetHostBusWidth(base, width);
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


