PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_OpsGoIdle
****************************************************************************//**
*
*  Send CMD0 (Go idle).
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_OpsGoIdle(SDHC_Type *base)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD0;
    cmd.commandArgument = 0UL;
    cmd.enableCrcCheck  = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_NONE;
    cmd.enableIdxCheck  = false;
    cmd.dataPresent     = false;
    cmd.cmdType         = CY_SD_HOST_CMD_ABORT;

    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_OpsVoltageSwitch
****************************************************************************//**
*
*  Send CMD11 (Signal Voltage Switch to 1.8 V).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_OpsVoltageSwitch(SDHC_Type *base,
        cy_stc_sd_host_context_t const *context)
{
    (void) context;
    cy_en_sd_host_status_t      ret;
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    pState;

    /* Voltage switch (CMD11). */
    cmd.commandIndex                 = CY_SD_HOST_SD_CMD11;
    cmd.commandArgument              = 0UL;
    cmd.enableCrcCheck               = true;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType                     = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableIdxCheck               = true;
    cmd.dataPresent                  = false;
    cmd.cmdType                      = CY_SD_HOST_CMD_NORMAL;

    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Disable providing the SD Clock. */
        Cy_SD_Host_DisableSdClk(base);

        pState = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

        /* Check DAT[3:0]. */
        if (0UL == pState)
        {
            /* Switch the bus to 1.8 V (Set the IO_VOLT_SEL pin to low)*/
            Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_1_8V);

            /* Wait 10 ms to 1.8 voltage regulator to be stable. */
            Cy_SysLib_Delay(CY_SD_HOST_1_8_REG_STABLE_TIME_MS);

            /* Check the 1.8V signaling enable. */
            if (true == _FLD2BOOL(SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN,
                                  SDHC_CORE_HOST_CTRL2_R(base)))
            {
                /* Enable providing the SD Clock. */
                Cy_SD_Host_EnableSdClk(base);

                /* Wait for the stable CLK */
                Cy_SysLib_Delay(CY_SD_HOST_CLK_RAMP_UP_TIME_MS);

                pState = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

                /* Check DAT[3:0]. */
                if (SDHC_CORE_PSTATE_REG_DAT_3_0_Msk != pState)
                {
                    ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
                }
            }
            else
            {
                ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
            }
        }
        else
        {
            ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_OpsSendIoRwDirectCmd
****************************************************************************//**
*
*  Sends CMD52 (Reads/writes 1 byte to the SDIO register).
*
* \param *base
*     The SD host registers structure pointer.
* \param rwFlag
* \param functionNumber
* \param rawFlag
* \param registerAddress
* \param data
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_OpsSendIoRwDirectCmd(SDHC_Type *base,
        uint32_t rwFlag,
        uint32_t functionNumber,
        uint32_t rawFlag,
        uint32_t registerAddress,
        uint32_t data)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD52;
    cmd.commandArgument = ((rwFlag & 0x01UL) << CY_SD_HOST_CMD52_RWFLAG_POS) |
                          ((functionNumber & CY_SD_HOST_CMD52_FUNCT_NUM_MSK) << CY_SD_HOST_CMD52_FUNCT_NUM_POS) |
                          ((rawFlag & 0x01UL) << CY_SD_HOST_CMD52_RAWFLAG_POS) |
                          ((registerAddress & CY_SD_HOST_CMD52_REG_ADDR_MSK) << CY_SD_HOST_CMD52_REG_ADDR_POS) |
                          (data & CY_SD_HOST_CMD52_DATA_MSK);

    cmd.dataPresent     = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48B;
    cmd.enableCrcCheck  = true;
    cmd.enableIdxCheck  = true;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    return ret;
}


