PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_OpsProgramCsd
****************************************************************************//**
*
*  Sends CMD27 (Sends the Program CSD command).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param csd
*     The Card-Specific Data register value.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_OpsProgramCsd(SDHC_Type *base,
        uint32_t csd,
        cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t       ret;
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dataConfig;
    uint32_t                     i;
    uint32_t                     blkSize = CY_SD_HOST_CSD_BLOCKS;
    uint32_t                     csdTepm;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD27;
    cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
    cmd.dataPresent     = true;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableCrcCheck  = true;
    cmd.enableIdxCheck  = true;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    dataConfig.blockSize            = CY_SD_HOST_CSD_BLOCKS;
    dataConfig.numberOfBlock        = 1UL;
    dataConfig.enableDma            = false;
    dataConfig.autoCommand          = CY_SD_HOST_AUTO_CMD_NONE;
    dataConfig.read                 = false;
    dataConfig.data                 = context->csd;
    dataConfig.dataTimeout          = CY_SD_HOST_MAX_TIMEOUT;
    dataConfig.enableIntAtBlockGap  = false;
    dataConfig.enReliableWrite      = false;

    /* The CSD register is sent using DAT lines. Initialize a data transfer in Non-DMA mode. */
    (void)Cy_SD_Host_InitDataTransfer(base, &dataConfig);

    /* Send the program CSD command (CMD27) */
    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait when buffer is read ready. */
        ret = Cy_SD_Host_PollBufferWriteReady(base);

        for (i = (blkSize >> 2UL); i != 0UL; i--)
        {
            /* The CSD register is sent a using usual data (8-bit width) type of the Data packet format.
             * The usual data (8-bit width) is sent in the LSB (Least Significant Byte) first,
             * MSB (Most Significant Byte) last. The bytes in each context->csd[] element
             * should be reordered and shifted right to one byte.
             */
            csdTepm = ((context->csd[i - 1UL] & CY_SD_HOST_CSD_ISBL_MASK) >> CY_SD_HOST_CSD_ISB_SHIFT) |
                      (context->csd[i - 1UL] & CY_SD_HOST_CSD_ISBR_MASK) |
                      ((context->csd[i - 1UL] & CY_SD_HOST_CSD_LSB_MASK) << CY_SD_HOST_CSD_ISB_SHIFT);

            if (i > 1UL)
            {
                csdTepm |= (context->csd[i - 2UL] & CY_SD_HOST_CSD_MSB_MASK);
            }
            else
            {
                csdTepm &= ~((1UL << CY_SD_HOST_CSD_TEMP_WRITE_PROTECT) | /* Clear TMP_WRITE_PROTECT bit in the CSD register. */
                             CY_SD_HOST_CSD_MSB_MASK);
                csdTepm |= csd; /* Set writable bits of the CSD register. */
            }

            (void)Cy_SD_Host_BufferWrite(base, csdTepm);
        }

        /* Wait for the transfer complete */
        ret = Cy_SD_Host_PollTransferComplete(base);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Check if the data line is free. */
            ret = Cy_SD_Host_PollDataLineFree(base);
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_OpsSdioSendOpCond
****************************************************************************//**
*
*  Send CMD5 (Send SDIO operation condition command).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \param cmdArgument
*     The command argument.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_OpsSdioSendOpCond(SDHC_Type *base,
        uint32_t *ocrReg,
        uint32_t cmdArgument)
{
    cy_en_sd_host_status_t      ret;
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    response = 0UL;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD5;
    cmd.commandArgument = cmdArgument;
    cmd.dataPresent     = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableCrcCheck  = false;
    cmd.enableIdxCheck  = false;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    /* Send the SDIO operation condition command (CMD5) */
    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    (void)Cy_SD_Host_GetResponse(base, (uint32_t *)&response, false);

    *ocrReg = response;

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_OpsSdSendOpCond
****************************************************************************//**
*
*  Send ACMD41 (Send SD operation condition command).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \param cmdArgument
*     The command argument.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_OpsSdSendOpCond(SDHC_Type *base,
        uint32_t *ocrReg,
        uint32_t cmdArgument,
        cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t      ret;
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    response = 0UL;

    cmd.commandIndex    = CY_SD_HOST_SD_ACMD41;
    cmd.commandArgument = cmdArgument;
    cmd.dataPresent     = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableCrcCheck  = false;
    cmd.enableIdxCheck  = false;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

