PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
        }
        else
        {
            /* Save the card type. */
            context->cardType = CY_SD_HOST_NOT_EMMC;
        }

        if (config->enableLedControl)
        {
            /* LED Control. */
            SDHC_CORE_HOST_CTRL1_R(base) = (uint8_t)_CLR_SET_FLD8U(SDHC_CORE_HOST_CTRL1_R(base),
                                           SDHC_CORE_HOST_CTRL1_R_LED_CTRL,
                                           1U);
        }

        /* Select ADMA or not. */
        SDHC_CORE_HOST_CTRL1_R(base) = (uint8_t)_CLR_SET_FLD8U(SDHC_CORE_HOST_CTRL1_R(base),
                                       SDHC_CORE_HOST_CTRL1_R_DMA_SEL,
                                       config->dmaType);

        /* Set the data timeout to the max. */
        SDHC_CORE_TOUT_CTRL_R(base) = _CLR_SET_FLD8U(SDHC_CORE_TOUT_CTRL_R(base),
                                      SDHC_CORE_TOUT_CTRL_R_TOUT_CNT,
                                      CY_SD_HOST_MAX_TIMEOUT);

        /* Enable all statuses. */
        Cy_SD_Host_SetNormalInterruptEnable(base, CY_SD_HOST_NORMAL_INT_MSK);
        Cy_SD_Host_SetErrorInterruptEnable(base, CY_SD_HOST_ERROR_INT_MSK);

        /* Enable Host Version 4. */
        SDHC_CORE_HOST_CTRL2_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_HOST_CTRL2_R(base),
                                       SDHC_CORE_HOST_CTRL2_R_HOST_VER4_ENABLE,
                                       1U);

#if !(defined SDHC_RETENTION_PRESENT && (SDHC_RETENTION_PRESENT == 0))
        /* Wait for the Host stable voltage. */
        Cy_SysLib_Delay(CY_SD_HOST_SUPPLY_RAMP_UP_TIME_MS);
#endif

        /* Reset normal events. */
        Cy_SD_Host_NormalReset(base);
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_DeInit
****************************************************************************//**
*
* Restores the SD Host block registers back to default. This API also disables
* SDHC block and user is expect to enable it back using \ref Cy_SD_Host_Enable
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
void Cy_SD_Host_DeInit(SDHC_Type *base)
{
    /* Check for the NULL pointer. */
    if (NULL != base)
    {
        (void)Cy_SD_Host_PollCmdLineFree(base);
        (void)Cy_SD_Host_PollDataLineNotInhibit(base);

        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_ALL);

        /* Disable the SDHC block. */
        SDHC_WRAP_CTL(base) = _CLR_SET_FLD32U(SDHC_WRAP_CTL(base),
                                              SDHC_WRAP_CTL_ENABLE,
                                              0UL);
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_AbortTransfer
****************************************************************************//**
*
*  Calling this function causes abortion of the currently executing command with
*  data. It doesn't issue a reset, that is the users responsibility.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t  Cy_SD_Host_AbortTransfer(SDHC_Type *base,
        cy_stc_sd_host_context_t const *context)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t                    response = 0UL;
    uint32_t                    retry;

    /* Check for the NULL pointer. */
    if ((NULL != base) && (NULL != context))
    {
        /* Check the card - Memory or SDIO? */
        if (CY_SD_HOST_SDIO == context->cardType)
        {
            ret = Cy_SD_Host_OpsSendIoRwDirectCmd(base,
                                                  1UL,
                                                  0UL,
                                                  0UL,
                                                  CY_SD_HOST_CCCR_IO_ABORT,
                                                  1UL);
        }
        else
        {
            cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
            cmd.dataPresent = false;
            cmd.enableAutoResponseErrorCheck = false;
            cmd.enableCrcCheck = true;
            cmd.enableIdxCheck = true;

            /* Issue CMD12. */
            cmd.respType = CY_SD_HOST_RESPONSE_LEN_48B;
            cmd.commandIndex = CY_SD_HOST_SD_CMD12;
            cmd.cmdType      = CY_SD_HOST_CMD_ABORT;
            ret = Cy_SD_Host_SendCommand(base, &cmd);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

                ret = CY_SD_HOST_ERROR_TIMEOUT;
                retry = CY_SD_HOST_RETRY_TIME;

                /* Waiting for DAT0 deassertion in scope of R1b response */
                while (retry > 0UL)
                {
                    /* Command Complete */
                    if ((Cy_SD_Host_GetPresentState(base) & CY_SD_HOST_DAT_0_Msk) == CY_SD_HOST_DAT_0_Msk)
                    {
                        ret = CY_SD_HOST_SUCCESS;
                        break;
                    }

                    Cy_SysLib_DelayUs(CY_SD_HOST_CMD_TIMEOUT_MS);
                    retry--;
                }
            }

            if (CY_SD_HOST_SUCCESS != ret)
            {
                return ret;
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

            Cy_SD_Host_ErrorReset(base);

            /* Issue CMD13. */
            cmd.respType = CY_SD_HOST_RESPONSE_LEN_48;
            cmd.commandIndex = CY_SD_HOST_SD_CMD13;
            cmd.cmdType      = CY_SD_HOST_CMD_NORMAL;
            ret = Cy_SD_Host_SendCommand(base, &cmd);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            if (CY_SD_HOST_SUCCESS != ret)
            {
                return ret;
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

