PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
        /* Software reset for the CMD line. */
        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_CMD_LINE);

        /* Voltage check (CMD8). */
        ret = Cy_SD_Host_OpsSendIfCond(base,
                                       CY_SD_HOST_CMD8_VHS_27_36 |
                                       CY_SD_HOST_CMD8_CHECK_PATTERN,
                                       false);

        /* Check the response. */
        (void)Cy_SD_Host_GetResponse(base,
                                     (uint32_t *)&response,
                                     false);

        /* Check the pattern. */
        if (CY_SD_HOST_CMD8_CHECK_PATTERN == (response &
                                              CY_SD_HOST_CMD8_PATTERN_MASK))
        {
            /* The pattern is valid. */
            f8Flag = true;
        }
        else if (CY_SD_HOST_VOLTAGE_CHECK_RETRY == retry)
        {
            /* CMD8 fails. Retry one more time */
        }
        else
        {
            /* The unusable card or the SDIO card. */
            ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
        }

        if ((CY_SD_HOST_ERROR_TIMEOUT == ret) || (f8Flag))
        {
            /* The pattern is valid or voltage mismatch (No response). */
            break;
        }

        retry--;
    }

    if (CY_SD_HOST_SUCCESS != ret)   /* The Idle state. */
    {
        /* Reset the error and the CMD line for the case of the SDIO card. */
        Cy_SD_Host_ErrorReset(base);
        Cy_SD_Host_NormalReset(base);
    }

    return f8Flag;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_IoOcr
****************************************************************************//**
*
*  Sends CMD5 to get IO OCR. Checks if IO is present (sdio),
*   if the memory is present (mpFlag) and if 1.8 signaling can be supported (s18aFlag).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param lowVoltageSignaling
*     The lowVoltageSignaling flag.
*
* \param *s18aFlag
*     The S18A flag (1.8 signaling support).
*
* \param *sdioFlag
*     The IO flag (the number of IO functions).
*
* \param *mpFlag
*     The MEM flag (memory support).
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_IoOcr(SDHC_Type *base,
        bool lowVoltageSignaling,
        uint32_t *s18aFlag,
        uint32_t *sdioFlag,
        bool *mpFlag,
        uint32_t *ocrReg)
{
    cy_en_sd_host_status_t ret;
    uint32_t               retry;

    /* Get IO OCR (CMD5) */
    ret = Cy_SD_Host_OpsSdioSendOpCond(base, ocrReg, 0UL);

    /* Get the number of IO functions. */
    *sdioFlag = *ocrReg & CY_SD_HOST_CMD5_IO_NUM_MASK;

    if (0UL < *sdioFlag)
    {
        if (true == lowVoltageSignaling)
        {
            /* Set the OCR to change the signal
            * voltage to 1.8 V for the UHS-I mode.
            */
            *ocrReg = (*ocrReg & CY_SD_HOST_IO_OCR_MASK) |
                      CY_SD_HOST_ACMD41_S18R;
        }

        retry = CY_SD_HOST_RETRY_TIME;
        while (retry > 0UL)
        {
            /* Set S18R and the voltage window in IO OCR (CMD5). */
            ret = Cy_SD_Host_OpsSdioSendOpCond(base,
                                               ocrReg,
                                               *ocrReg);

            /* Check the IO power up status. */
            if (CY_SD_HOST_SUCCESS == ret)
            {
                if (CY_SD_HOST_IO_OCR_C == (*ocrReg & CY_SD_HOST_IO_OCR_C))
                {
                    /* The SDIO card supports 1.8 signaling. */
                    *s18aFlag = 1UL;
                }

                if (CY_SD_HOST_CMD5_MP_MASK == (*ocrReg & CY_SD_HOST_CMD5_MP_MASK))
                {
                    /* MP = 1. (The memory is supported.) */
                    *mpFlag = true;
                }

                /* IO > 0. */
                break;
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_SDIO_CMD5_TIMEOUT_MS); /* 1 sec timeout. */
            retry--;
        }

        if (CY_SD_HOST_SUCCESS != ret)
        {
            /* IO = 0. */
            *sdioFlag = 0UL;
        }
    }
    else
    {
        /* Software reset for the DAT line. */
        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_DATALINE);

        /* IO = 0. We have the SD memory card. Reset errors. */
        Cy_SD_Host_ErrorReset(base);

    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SdOcr
****************************************************************************//**
*
*  Sends ACMD41 to get SD OCR.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param lowVoltageSignaling
*     The lowVoltageSignaling flag.
*
* \param *s18aFlag
*     The S18A flag (1.8 signaling support).
*
* \param *mpFlag
*     The MEM flag (memory support).
*
* \param f8Flag
*     The CMD8 flag.
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_SdOcr(SDHC_Type *base,
        bool lowVoltageSignaling,
        uint32_t *s18aFlag,
        bool *mpFlag,
        bool f8Flag,
        uint32_t *ocrReg,
        cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret;
    uint32_t               response = 0UL;  /* The CMD response. */
    uint32_t               retry;
    uint32_t               cmdArgument;

    /* Get OCR (ACMD41). The voltage window = 0. */
    ret = Cy_SD_Host_OpsSdSendOpCond(base,
                                     ocrReg,
                                     0x00000000UL,
                                     context);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Set the voltage window from 2.7 to 3.6 V.  */
        cmdArgument = CY_SD_HOST_ACMD41_VOLTAGE_MASK;

