PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_IsWpSet
****************************************************************************//**
*
*  Returns the state of the write protect switch on the SD card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \note If user is using a custom pin to control write protection,
* user must implement weak Cy_SD_Host_IsWpSet() and read the pin status.
*
* \return bool
*     true - the write protect is set, false - the write protect is not set.
*
*******************************************************************************/
__WEAK bool Cy_SD_Host_IsWpSet(SDHC_Type const *base)
{
    return _FLD2BOOL(SDHC_CORE_PSTATE_REG_WR_PROTECT_SW_LVL, SDHC_CORE_PSTATE_REG(base));
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetHostBusWidth
****************************************************************************//**
*
*  Only changes the bus width on the host side.
*  It doesn't change the bus width on the card side.
*  To change the bus width on the card, call Cy_SD_Host_SetBusWidth().
*
* \param *base
*     The SD host registers structure pointer.
*
* \param width
*     The width of the data bus.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SetHostBusWidth(SDHC_Type *base,
        cy_en_sd_host_bus_width_t width)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        SDHC_CORE_HOST_CTRL1_R(base) = (uint8_t)(((uint32_t)SDHC_CORE_HOST_CTRL1_R(base) &
                                       ~(SDHC_CORE_HOST_CTRL1_R_EXT_DAT_XFER_Msk |
                                         SDHC_CORE_HOST_CTRL1_R_DAT_XFER_WIDTH_Msk)) |
                                       (_BOOL2FLD(SDHC_CORE_HOST_CTRL1_R_EXT_DAT_XFER, (CY_SD_HOST_BUS_WIDTH_8_BIT == width)) |
                                        _BOOL2FLD(SDHC_CORE_HOST_CTRL1_R_DAT_XFER_WIDTH, (CY_SD_HOST_BUS_WIDTH_4_BIT == width))));

        ret = CY_SD_HOST_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetHostSpeedMode
****************************************************************************//**
*
*  Only updates the host register to indicate bus speed mode and the general
*  purpose output register to select card clock input and output delay.
*  This function doesn't change the speed on the bus, or change anything
*  in the card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param speedMode
*     Bus Speed mode.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SetHostSpeedMode(SDHC_Type *base,
        cy_en_sd_host_bus_speed_mode_t speedMode)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;
    uint32_t               inDelay = 0UL;
    uint32_t               outDelay = 0UL;
    uint32_t               ultraHighSpeed = 0UL;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        /* UHS Mode/eMMC Speed Mode Select */
        switch (speedMode)
        {
        case CY_SD_HOST_BUS_SPEED_EMMC_LEGACY:
        case CY_SD_HOST_BUS_SPEED_DEFAULT:
        case CY_SD_HOST_BUS_SPEED_SDR12_5:
            ultraHighSpeed = CY_SD_HOST_SDR12_SPEED; /* Max clock = 25 MHz */
            break;
        case CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR:
        case CY_SD_HOST_BUS_SPEED_SDR25:
        case CY_SD_HOST_BUS_SPEED_HIGHSPEED:
            ultraHighSpeed = CY_SD_HOST_SDR25_SPEED; /* Max clock = 50 MHz */
            break;
        case CY_SD_HOST_BUS_SPEED_SDR50:
            ultraHighSpeed = CY_SD_HOST_SDR50_SPEED; /* Max clock = 100 MHz */
            break;
        case CY_SD_HOST_BUS_SPEED_DDR50:
            ultraHighSpeed = CY_SD_HOST_DDR50_SPEED; /* Max clock = 50 MHz */
            break;
        default:
            ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
            break;
        }

        /* Card clock output delay select */
        switch (speedMode)
        {
        case CY_SD_HOST_BUS_SPEED_EMMC_LEGACY:
        case CY_SD_HOST_BUS_SPEED_DEFAULT:
        case CY_SD_HOST_BUS_SPEED_SDR12_5:
        case CY_SD_HOST_BUS_SPEED_HIGHSPEED:
            outDelay = CY_SD_HOST_SDR12_OUT_DELAY;
            break;
        case CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR:
        case CY_SD_HOST_BUS_SPEED_SDR25:
        case CY_SD_HOST_BUS_SPEED_SDR50:
            outDelay = CY_SD_HOST_SDR25_OUT_DELAY;
            break;
        case CY_SD_HOST_BUS_SPEED_DDR50:
            outDelay = CY_SD_HOST_DDR50_OUT_DELAY;
            break;
        default:
            ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
            break;
        }

        /* Card clock input delay select */
        switch (speedMode)
        {
        case CY_SD_HOST_BUS_SPEED_EMMC_LEGACY:
        case CY_SD_HOST_BUS_SPEED_DEFAULT:
        case CY_SD_HOST_BUS_SPEED_SDR12_5:
            inDelay = CY_SD_HOST_SDR12_IN_DELAY;
            break;
        case CY_SD_HOST_BUS_SPEED_SDR25:
        case CY_SD_HOST_BUS_SPEED_SDR50:
            inDelay = CY_SD_HOST_SDR25_IN_DELAY;
            break;
        case CY_SD_HOST_BUS_SPEED_HIGHSPEED:
        case CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR:
            inDelay = CY_SD_HOST_HIGH_SPEED_IN_DELAY;
            break;
        case CY_SD_HOST_BUS_SPEED_DDR50:
            inDelay = CY_SD_HOST_DDR50_IN_DELAY;
            break;
        default:
            ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
            break;
        }

        if (CY_SD_HOST_ERROR_INVALID_PARAMETER != ret)
        {
            SDHC_CORE_HOST_CTRL1_R(base) = (uint8_t)_CLR_SET_FLD8U(SDHC_CORE_HOST_CTRL1_R(base),
                                           SDHC_CORE_HOST_CTRL1_R_HIGH_SPEED_EN,
                                           ((CY_SD_HOST_BUS_SPEED_HIGHSPEED == speedMode) ? 1UL : 0UL));

            SDHC_CORE_HOST_CTRL2_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_HOST_CTRL2_R(base),
                                           SDHC_CORE_HOST_CTRL2_R_UHS_MODE_SEL,
                                           ultraHighSpeed);

