PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
            SDHC_CORE_GP_OUT_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_GP_OUT_R(base),
                                       SDHC_CORE_GP_OUT_R_CARD_CLOCK_IN_DLY,
                                       inDelay);

            SDHC_CORE_GP_OUT_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_GP_OUT_R(base),
                                       SDHC_CORE_GP_OUT_R_CARD_CLOCK_OUT_DLY,
                                       outDelay);
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetBusSpeedMode
****************************************************************************//**
*
*  Negotiates with the card to change the bus speed mode of the card
*  and the host. It doesn't change the SD clock frequency that must be done
*  separately.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param speedMode
*     Bus speed mode.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SetBusSpeedMode(SDHC_Type *base,
        cy_en_sd_host_bus_speed_mode_t speedMode,
        cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t  ret = CY_SD_HOST_SUCCESS;
    uint32_t                highSpeedValue = CY_SD_HOST_DEFAULT_SPEED;
    uint32_t                cmdArgument = 0UL;
    uint32_t                response[CY_SD_HOST_RESPONSE_SIZE] = { 0UL };

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        CY_ASSERT_L3(CY_SD_HOST_IS_SPEED_MODE_VALID(speedMode));

        /* 1. Does the card support memory? */
        if ((CY_SD_HOST_SD == context->cardType) ||
                (CY_SD_HOST_EMMC == context->cardType) ||
                (CY_SD_HOST_COMBO == context->cardType))
        {
            /* 2. Change Bus Speed Mode: Issue CMD6 with mode 1 */
            switch (speedMode)
            {
            case CY_SD_HOST_BUS_SPEED_EMMC_LEGACY:
            case CY_SD_HOST_BUS_SPEED_DEFAULT:
            case CY_SD_HOST_BUS_SPEED_SDR12_5:
                highSpeedValue = CY_SD_HOST_SDR12_SPEED; /* Max clock = 25 MHz */
                break;
            case CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR:
            case CY_SD_HOST_BUS_SPEED_SDR25:
            case CY_SD_HOST_BUS_SPEED_HIGHSPEED:
                highSpeedValue = CY_SD_HOST_SDR25_SPEED; /* Max clock = 50 MHz */
                break;
            case CY_SD_HOST_BUS_SPEED_SDR50:
                highSpeedValue = CY_SD_HOST_SDR50_SPEED; /* Max clock = 100 MHz */
                break;
            case CY_SD_HOST_BUS_SPEED_DDR50:
                highSpeedValue = CY_SD_HOST_DDR50_SPEED; /* Max clock = 50 MHz */
                break;
            default:
                ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                break;
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                if ((CY_SD_HOST_SD == context->cardType) ||
                        (CY_SD_HOST_COMBO == context->cardType))
                {
                    /* Set the mode bit to 1 and select the default function */
                    cmdArgument = (1UL << CY_SD_HOST_SWITCH_FUNCTION_BIT);

                    /* Set the High Speed/SDR25 bit */
                    cmdArgument |= highSpeedValue & 0xFUL;

                    /* Send CMD6 and parse response */
                    ret = Cy_SD_Host_SdCardSwitchFunc(base, cmdArgument, context->cardType);
                }
                else
                {
                    cmdArgument = (CY_SD_HOST_EMMC_ACCESS_WRITE_BYTE << CY_SD_HOST_EMMC_CMD6_ACCESS_OFFSET) |
                                  (CY_SD_HOST_EMMC_HS_TIMING_ADDR << CY_SD_HOST_EMMC_CMD6_IDX_OFFSET) |
                                  (highSpeedValue << CY_SD_HOST_EMMC_CMD6_VALUE_OFFSET) |
                                  (0x0UL << CY_SD_HOST_EMMC_CMD6_CMD_SET_OFFSET);

                    /* Send CMD6 */
                    ret = Cy_SD_Host_OpsSwitchFunc(base, cmdArgument);
                }
            }
        }

        /* 5. Is SDIO Supported? */
        if ((CY_SD_HOST_SDIO == context->cardType) ||
                (CY_SD_HOST_COMBO == context->cardType))
        {
            /* 6. Change Bus Speed Mode: Set EHS or BSS[2:0] in CCCR */
            ret = Cy_SD_Host_OpsSendIoRwDirectCmd(base,
                                                  0UL,
                                                  0UL,
                                                  0UL,
                                                  CY_SD_HOST_CCCR_SPEED_CONTROL,
                                                  0UL);

            (void)Cy_SD_Host_GetResponse(base, (uint32_t *)response, false);

            /* Check the SHS bit - the High Speed mode operation ability  */
            if (0UL != (response[0] & CY_SD_HOST_CCCR_SPEED_SHS_MASK))
            {
                switch (speedMode)
                {
                case CY_SD_HOST_BUS_SPEED_DEFAULT:
                case CY_SD_HOST_BUS_SPEED_SDR12_5:
                    /* BSS0 = 0, BSS1 = 0  */
                    break;
                case CY_SD_HOST_BUS_SPEED_SDR25:
                case CY_SD_HOST_BUS_SPEED_HIGHSPEED:
                    response[0] |= CY_SD_HOST_CCCR_SPEED_BSS0_MASK;
                    break;
                case CY_SD_HOST_BUS_SPEED_SDR50:
                    response[0] |= CY_SD_HOST_CCCR_SPEED_BSS1_MASK;
                    break;
                case CY_SD_HOST_BUS_SPEED_DDR50:
                    response[0] |= CY_SD_HOST_CCCR_SPEED_BSS2_MASK;
                    break;
                default:
                    ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                    break;
                }

                /* Set the EHS bit to enable High Speed mode */
                if (CY_SD_HOST_SUCCESS == ret)
                {
                    highSpeedValue = response[0] & (CY_SD_HOST_CCCR_SPEED_BSS0_MASK |
                                                    CY_SD_HOST_CCCR_SPEED_BSS1_MASK |
                                                    CY_SD_HOST_CCCR_SPEED_SHS_MASK);

                    ret = Cy_SD_Host_OpsSendIoRwDirectCmd(base,
                                                          1UL,
                                                          0UL,
                                                          0UL,
                                                          CY_SD_HOST_CCCR_SPEED_CONTROL,
                                                          response[0]);

                    (void)Cy_SD_Host_GetResponse(base, (uint32_t *)response, false);

                    response[0] = response[0] & (CY_SD_HOST_CCCR_SPEED_BSS0_MASK |
                                                 CY_SD_HOST_CCCR_SPEED_BSS1_MASK |
                                                 CY_SD_HOST_CCCR_SPEED_SHS_MASK);

                    if (highSpeedValue != response[0])
                    {
                        ret = CY_SD_HOST_ERROR_UNINITIALIZED;
                    }
                }
            }
            else
            {
                /* The card can operate in High Speed mode only. */
            }
        }

