PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
        /* 3 and 7. Bus Speed Mode changed Successfully  */
        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* 4 and 8. Set the same bus speed mode in the host controller */
            ret = Cy_SD_Host_SetHostSpeedMode(base, speedMode);
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_FindBusSpeedMode
****************************************************************************//**
*
*  Negotiates with the card to find the highest supported bus speed mode
*  of the card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param lowVoltageSignaling
*     Support for 1.8V signaling in card and host.
*
* \param cardType
*     The type of card.
*
* \note
*     This function is applicable only for \ref CY_SD_HOST_SD &
*     \ref CY_SD_HOST_COMBO card types
*
* \return \ref cy_en_sd_host_bus_speed_mode_t
*
*******************************************************************************/
static cy_en_sd_host_bus_speed_mode_t Cy_SD_Host_FindBusSpeedMode(SDHC_Type *base,
        bool lowVoltageSignaling,
        cy_en_sd_host_card_type_t cardType)
{
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dataConfig;
    uint32_t status[CY_SD_HOST_SWITCH_STATUS_LEN];
    cy_en_sd_host_status_t  ret = CY_SD_HOST_SUCCESS;
    cy_en_sd_host_bus_speed_mode_t speedMode = CY_SD_HOST_BUS_SPEED_DEFAULT;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD6;
    cmd.commandArgument = 0x0UL;
    cmd.dataPresent     = true;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableCrcCheck  = true;
    cmd.enableIdxCheck  = true;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    dataConfig.blockSize           = CY_SD_HOST_SD_STATUS_BLOCKS;
    dataConfig.numberOfBlock       = 1UL;
    dataConfig.enableDma           = false;
    dataConfig.autoCommand         = CY_SD_HOST_AUTO_CMD_NONE;
    dataConfig.read                = true;
    dataConfig.data                = status;
    dataConfig.dataTimeout         = CY_SD_HOST_MAX_TIMEOUT;
    dataConfig.enableIntAtBlockGap = false;
    dataConfig.enReliableWrite     = false;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        if ((cardType == CY_SD_HOST_SD) || (cardType == CY_SD_HOST_COMBO))
        {
            (void)Cy_SD_Host_InitDataTransfer(base, &dataConfig);

            ret = Cy_SD_Host_SendCommand(base, &cmd);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the response on the DAT lines. */
                ret = Cy_SD_Host_CmdRxData(base, &dataConfig);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Parse the response on DAT lines and assign bus.speed mode */
                if ((bool)(status[3] & 0x0000800UL)) /* Bit 404 refers to DDR50 support in 512 bit SD status */
                {
                    speedMode = CY_SD_HOST_BUS_SPEED_DDR50;
                }
                else if ((bool)(status[3] & 0x00002000UL))  /* Bit 402 refers to SDR50 support in 512 bit SD status */
                {
                    speedMode = CY_SD_HOST_BUS_SPEED_SDR50;
                }
                else if ((bool)(status[3] & 0x00004000UL))  /* Bit 401 refers to SDR25/High-Speed support in 512 bit SD status */
                {
                    if (lowVoltageSignaling)
                    {
                        speedMode = CY_SD_HOST_BUS_SPEED_SDR25;
                    }
                    else
                    {
                        speedMode = CY_SD_HOST_BUS_SPEED_HIGHSPEED;
                    }
                }
                else if ((bool)(status[3] & 0x00008000UL)) /* Bit 400 refers to SDR12_5/Default support in 512 bit SD status */
                {
                    if (lowVoltageSignaling)
                    {
                        speedMode = CY_SD_HOST_BUS_SPEED_SDR12_5;
                    }
                    else
                    {
                        speedMode = CY_SD_HOST_BUS_SPEED_DEFAULT;
                    }
                }
                else
                {
                    speedMode = CY_SD_HOST_BUS_SPEED_DEFAULT;
                }
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);
        }
    }

    return speedMode;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SelBusVoltage
****************************************************************************//**
*
*  Negotiates with the SD card to change the bus signaling level to 1.8V.
*  After this function is called, the card is in the ready state.
*
* \note The host needs to change the regulator supplying voltage to
*       the VDDIO of the SD block in order to operate at 1.8V.
* \note This function changes RCA to 0 in the context. RCA in the context
*       should be updated (context.RCA = Cy_SD_Host_GetRca();)
*       when the card is in the Identification state.
* \note This function is applicable for SD cards only.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param enable18VSignal
*     If true, use the 1.8V signaling, false - use the 3.3V signaling.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
* \note The SD card power supply should be disabled and initialized again when
*  this function returns CY_SD_HOST_ERROR_UNUSABLE_CARD.
*
* \note The dedicated io_volt_sel pin is used to change the regulator supplying
* voltage to the VDDIO of the SD block in order to operate at 1.8V. To configure
* the custom IO pin in order to control (using the GPIO driver) the regulator
* supplying voltage, the user must implement weak Cy_SD_Host_ChangeIoVoltage().
* Also, this function must set the SIGNALING_EN bit of the SDHC_CORE_HOST_CTRL2_R
* register when ioVoltage = CY_SD_HOST_IO_VOLT_1_8V.
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_SelBusVoltage(SDHC_Type *base,
        bool enable18VSignal,
        cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret;
    uint32_t               ocrReg; /* The Operation Condition register. */
    uint32_t               s18aFlag = 0UL; /* The S18A flag. */
    bool                   f8Flag = false; /* The CMD8 flag. */
    bool                   mpFlag = false; /* The MEM flag. */

    context->RCA = 0UL;

    /* Send CMD0 and CMD8 commands. */
    f8Flag = Cy_SD_Host_VoltageCheck(base);

    /* Clear the insert event */
    Cy_SD_Host_NormalReset(base);

