PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
    /* Send ACMD41 */
    ret = Cy_SD_Host_SdOcr(base,
                           enable18VSignal,
                           &s18aFlag,
                           &mpFlag,
                           f8Flag,
                           &ocrReg,
                           context);

    if ((CY_SD_HOST_SUCCESS == ret) && (enable18VSignal) && (1UL == s18aFlag))
    {
        /* Voltage switch (CMD11). */
        ret = Cy_SD_Host_OpsVoltageSwitch(base, context);
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_EnableCardVoltage
****************************************************************************//**
*
*  Sets the card_if_pwr_en pin high.
*  This pin can be used to enable a voltage regulator used to power the card.
*
* \note If user is using a custom pin/regulator to enable card voltage,
* user must implement weak Cy_SD_Host_EnableCardVoltage().
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__WEAK void Cy_SD_Host_EnableCardVoltage(SDHC_Type *base)
{
    SDHC_CORE_PWR_CTRL_R(base) = _CLR_SET_FLD8U(SDHC_CORE_PWR_CTRL_R(base), SDHC_CORE_PWR_CTRL_R_SD_BUS_PWR_VDD1, 1UL);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_DisableCardVoltage
****************************************************************************//**
*
*  Sets the card_if_pwr_en pin low.
*  This pin can be used to disable a voltage regulator used to power the card.
*
* \note If user is using a custom pin/regulator to disable card voltage,
* user must implement weak Cy_SD_Host_DisableCardVoltage().
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__WEAK void Cy_SD_Host_DisableCardVoltage(SDHC_Type *base)
{

    SDHC_CORE_PWR_CTRL_R(base) = _CLR_SET_FLD8U(SDHC_CORE_PWR_CTRL_R(base), SDHC_CORE_PWR_CTRL_R_SD_BUS_PWR_VDD1, 0UL);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetResponse
****************************************************************************//**
*
* This function reads the response register from the last completed command.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *responsePtr
*     The pointer to response data.
*
* \param largeResponse
*     If true, the response is 136 bits, false - 32 bits.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t  Cy_SD_Host_GetResponse(SDHC_Type const *base,
        uint32_t *responsePtr,
        bool largeResponse)
{
    cy_en_sd_host_status_t  ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    volatile uint32_t const *responseBaseAddr;
    uint8_t                 i;
    uint8_t                 responseLength = (true == largeResponse) ? CY_SD_HOST_RESPONSE_SIZE : 1U;

    if ((NULL != base) &&
            (NULL != responsePtr))
    {
        /* Get the Response Register 0 address */
        responseBaseAddr = &SDHC_CORE_RESP01_R(base);

        /* Read the largeResponse Response registers values */
        for (i = 0U; i < responseLength; i++)
        {
            *responsePtr = *responseBaseAddr;
            responsePtr++;
            responseBaseAddr++;
        }

        ret = CY_SD_HOST_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_InitDataTransfer
****************************************************************************//**
*
*  Initializes the SD block for a data transfer. It does not start a transfer.
*  To start a transfer call Cy_SD_Host_SendCommand() after calling this function.
*  If DMA is not used for data transfer, the buffer needs to be filled
*  with data first if this is a write.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param dataConfig
*     The pointer to the data transfer configuration structure.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_InitDataTransfer(SDHC_Type *base,
        cy_stc_sd_host_data_config_t const *dataConfig)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;
    uint32_t               dmaMode;
    uint32_t               transferMode;

    if ((NULL != base) && (NULL != dataConfig) && (NULL != dataConfig->data))
    {
        while (retry > 0UL)
        {
            if ((!_FLD2BOOL(SDHC_CORE_PSTATE_REG_DAT_LINE_ACTIVE, SDHC_CORE_PSTATE_REG(base))) && \
                    (!_FLD2BOOL(SDHC_CORE_PSTATE_REG_CMD_INHIBIT, SDHC_CORE_PSTATE_REG(base))) && \
                    (!_FLD2BOOL(SDHC_CORE_PSTATE_REG_CMD_INHIBIT_DAT, SDHC_CORE_PSTATE_REG(base))))
            {
                CY_ASSERT_L3(CY_SD_HOST_IS_AUTO_CMD_VALID(dataConfig->autoCommand));
                CY_ASSERT_L2(CY_SD_HOST_IS_TIMEOUT_VALID(dataConfig->dataTimeout));
                CY_ASSERT_L2(CY_SD_HOST_IS_BLK_SIZE_VALID(dataConfig->blockSize, _FLD2VAL(SDHC_CORE_HOST_CTRL2_R_UHS_MODE_SEL, SDHC_CORE_HOST_CTRL2_R(base))));

                ret = CY_SD_HOST_SUCCESS;
                dmaMode = _FLD2VAL(SDHC_CORE_HOST_CTRL1_R_DMA_SEL, SDHC_CORE_HOST_CTRL1_R(base));

                SDHC_CORE_BLOCKSIZE_R(base) = 0U;
                SDHC_CORE_XFER_MODE_R(base) = 0U;

                if (((uint32_t)CY_SD_HOST_DMA_ADMA2_ADMA3 == dmaMode) && (dataConfig->enableDma))
                {
                    /* ADMA3 Integrated Descriptor Address. */
                    SDHC_CORE_ADMA_ID_LOW_R(base) = (uint32_t)dataConfig->data;
                }
                else
                {
                    if (dataConfig->enableDma)
                    {
                        /* Set the ADMA descriptor table. */
                        if ((uint32_t)CY_SD_HOST_DMA_SDMA == dmaMode)
                        {
                            /* Set 512K bytes SDMA Buffer Boundary. */
                            SDHC_CORE_BLOCKSIZE_R(base) = _CLR_SET_FLD16U(SDHC_CORE_BLOCKSIZE_R(base),
                                                          SDHC_CORE_BLOCKSIZE_R_SDMA_BUF_BDARY,
                                                          CY_SD_HOST_SDMA_BUF_BYTES_512K);

                            if (true == _FLD2BOOL(SDHC_CORE_HOST_CTRL2_R_HOST_VER4_ENABLE, SDHC_CORE_HOST_CTRL2_R(base)))
                            {
                                /* The data address. */
                                SDHC_CORE_ADMA_SA_LOW_R(base) = (uint32_t)dataConfig->data;

