PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sd_host.c
            cy_en_sd_host_status_t result;
            result = Cy_SD_Host_Init(locBase, &local_config, locContext);
            if (result == CY_SD_HOST_SUCCESS)
            {
                ret = CY_SYSPM_SUCCESS;
            }
            /* valid card was present before DS, re init card */
            if (locContext->RCA != 0U)
            {
                cy_stc_sd_host_sd_card_config_t cardConfig;
                cardConfig.rca = &locContext->RCA;
                cardConfig.cardType = &locContext->cardType;
                cardConfig.cardCapacity = &locContext->cardCapacity;
                cardConfig.busWidth = locContext->busWidth;
                result = Cy_SD_Host_InitCard(locBase, &cardConfig, locContext);
                if (result == CY_SD_HOST_SUCCESS)
                {
                    ret = CY_SYSPM_SUCCESS;
                }
            }
            else
            {
                SDHC_CORE_CLK_CTRL_R(locBase) = clk_ctl_r;
                Cy_SD_Host_SetNormalInterruptMask(locBase, normal_mask);
                Cy_SD_Host_SetErrorInterruptMask(locBase, error_mask);
                SDHC_CORE_HOST_CTRL1_R(locBase) = ctrl1;
                SDHC_CORE_HOST_CTRL2_R(locBase) = ctrl2;
                SDHC_CORE_GP_OUT_R(locBase) = gp_out;
            }

#if (defined SDHC1_RETENTION_PRESENT && (SDHC1_RETENTION_PRESENT == 0))
        }
#endif

#endif /* (defined SDHC_RETENTION_PRESENT && (SDHC_RETENTION_PRESENT == 0)) */

        ret = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (ret);
}

/*******************************************************************************
* Function Name: Cy_SD_Host_GetBlockCount
****************************************************************************//**
*
*  Returns the Block count in SD/eMMC Card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *block_count
*     The pointer to store the block_count.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetBlockCount(SDHC_Type *base,
        uint32_t *block_count,
        cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != block_count) && (NULL != context))
    {
        if ((CY_SD_HOST_SD == context->cardType) || (CY_SD_HOST_EMMC == context->cardType))
        {
            *block_count = context->maxSectorNum;
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.1')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSDHC */

/* [] END OF FILE */
